{"id": "img/32106.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black people (even children) are likely to steal and can be presumed guilty.\",\n        \"rationale\": \"The meme accuses the pictured Black child of theft (“other than he stole a wheelchair”), which activates a stereotype linking Black people to criminal behavior. That allegation targets race/ethnicity and uses the image of a child to reinforce presumptive guilt and humiliation, functioning as racial stereotyping and prejudice conveyed through a written provocation/insult.\"\n      }],\n \"targets\": [\n      \"Race/Ethnicity\",\n      \"Disability\",\n ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Defamation\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/95426.png", "response": "{\"hate_frames\":{\"frames\":[{\"frame\":\"Jewish people are despicable, subhuman, and should be hated and ostracized.\",\"rationale\":\"The meme's text explicitly declares \\\"I hate all fucking jews\\\" and calls them \\\"scum of the earth,\\\" which dehumanizes and vilifies an entire religious group. This is a direct expression of hate and humiliation toward a protected group (religion/belief) and promotes their exclusion and marginalization.\"}],\"targets\":[\"Religion/Belief\"],\"intents\":[\"Hate\",\"Prejudice\",\"Humiliation\",\"Exclusion\",\"Marginalization\"],\"actions\":[\"Insults\",\"Provocation\",\"Defamation\"]}}"}
{"id": "img/89640.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Women (girlfriends) are equivalent to household appliances that meant to perform domestic labor.\",\n        \"rationale\": \"The meme's punchline ('now there are two of them!') directly equates the girlfriend with a dishwasher, reducing a person to an appliance. That dehumanizes women by treating them as objects whose value lies in performing household tasks. This conveys a sexist stereotype about women's role in the home and uses that stereotype as the basis for humor, which is a form of humiliation and prejudice against the target.\"\n      },\n      {\n        \"frame\": \"It's acceptable to mock and belittle women by reducing them to stereotyped domestic roles.\",\n        \"rationale\": \"The image of a woman doing dishes paired with the text encourages viewers to laugh at the idea that a girlfriend and a dishwasher are interchangeable. That normalizes stereotyping and social marginalization of women (portraying them primarily as domestic workers) and performs an insulting, provocative act in written/verbal form to demean the target.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"],\n    \"intents\": [\n      \"Stereotyping\",\n      \"Humiliation\",\n  \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/57124.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Jewish people are inherently cheap/greedy and will try to avoid paying their fair share.\",\n        \"rationale\": \"The image caption '13 jews splitting the check' plus speech bubbles ('i only had a salad', 'you had the steak!', 'i seem to have forgotten my wallet', 'oh! big surprise') attribute stinginess, dishonesty, and money-hoarding to Jews as a whole. This generalizes a negative financial stereotype to an entire religious group and portrays them as untrustworthy and miserly, which is a classic antisemitic trope intended to humiliate and demean the target.\"\n      }],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Exclusion\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/91803.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslims are sexually deviant and engage in bestiality.\",\n        \"rationale\": \"The meme pairs an image of a bearded man wearing clothing commonly associated with Muslim or South Asian/Middle Eastern identity with the repeated caption 'fucks a goat.' That textual accusation of bestiality applied to this visual cue frames the group as sexually deviant. This is a demeaning stereotype and a defamatory sexual slur aimed at a protected religious/ethnic group, meant to humiliate and provoke viewers.\"\n      }], \n    \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\",\n      \"Appearance\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Hate\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Defamation\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/04786.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Transgender identities are a mental illness and a rejection of reality.\",\n        \"rationale\": \"The meme explicitly labels being transgender as a \\\"mental illness\\\" and characterizes it as a \\\"rejection of reality,\\\" which pathologizes transgender people. This framing delegitimizes gender identity, reduces individuals to a disorder, and functions to shame and stigmatize the target group. The language is a verbal attack that expresses prejudice and aims to humiliate and marginalize transgender people.\"\n      },\n      {\n        \"frame\": \"Being transgender is inherently harmful, leading to anxiety, depression, self-mutilation and suicide.\",\n        \"rationale\": \"The meme links transgender identity causally to mental health crises and self-harm and then uses that alleged harm to argue it is \\\"not healthy.\\\" This frames transgender people as dangerous to themselves and implies they are a problem to be rejected or excluded. Such a harm-focused frame can be used to justify discrimination, denial of affirmation or healthcare, and social exclusion, while amplifying stigma and fear toward the group.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\",\n      \"Discrimination\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Defamation\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/42503.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Members of muslim religion are products of inbreeding and therefore genetically inferior.\",\n        \"rationale\": \"The meme's caption calls out 'inbreeding' and 'i stand here as living proof' over a photo of men who appear to be Muslim/protesters, framing the whole group as biologically defective. This is a derogatory, demeaning portrayal that generalizes from appearance/religion to genetic inferiority, reflecting prejudice and hatred toward a demographic group (religion/ethnicity) and encouraging humiliation and exclusion.\"\n      },],  \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/47136.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Jewish people are greedy and obsessively focused on money.\",\n        \"rationale\": \"The image shows visibly Jewish men (Hasidic dress and payot) paired with the repeated caption \\\"money money money!!!\\\", which invokes a long-standing antisemitic trope that Jewish people are primarily concerned with money. This reduces a religious/ethnic group to a negative economic stereotype and functions to humiliate and demean them.\"\n      },\n      \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Stereotyping\",\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/72945.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Opening borders to migrants (specifically from Africa) is an unwanted 'enrichment' that will harm the host society.\",\n        \"rationale\": \"The caption 'open up for the enrichment' paired with a photo of a large crowd uses the term 'enrichment' sarcastically — a known euphemism in anti-immigrant rhetoric — to portray migrants as a threat or burden. This conveys prejudice and fear about people from other national/regional backgrounds (and implicitly about their ethnicity), encouraging exclusionary attitudes toward immigration policies.\"\n      }], \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Exclusion\",\n      \"Stereotyping\",\n      \"Propaganda\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Provocation\",\n      \"Insults\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/92408.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Other ethnic and religious groups intentionally exclude Black-owned businesses while thriving in Black neighborhoods.\",\n        \"rationale\": \"The meme's text contrasts 'china town' and 'jew town' with 'black town', claiming those other neighborhoods \\\"don't see negro stores\\\" whereas Black neighborhoods have \\\"every kind of store... but yours.\\\" This frames non-Black groups as deliberately excluding Black merchants and paints that exclusion as an economic injustice aimed at Black people (a racial/ethnic group). The language expresses prejudice and seeks to provoke grievance about economic marginalization and exclusion.\"\n      },,\n      {\n        \"frame\": \"Using derogatory labels (e.g., 'negro', 'jew town') is acceptable to name and shame groups and to stoke inter-group hostility.\",\n        \"rationale\": \"The text uses dated/derogatory terms and group-labeling in a provocative way. That verbal framing functions as an insult and provocation, encouraging hostility and humiliation of the named groups (both as targets and as alleged perpetrators/excluders). The language is intended to inflame emotions and promote conflict between groups.\"\n      }\n    ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\",\n      \"Religion/Belief\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Discrimination\",\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Conflict\",\n      \"Stereotyping\",\n      \"Exclusion\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/01469.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslim children are equivalent to bombs and can be violently neutralized.\",\n        \"rationale\": \"The meme explicitly equates 'the muslim kid' with a bomb by pairing a description of punching a child to death with the caption 'the bomb has been defused.' The juxtaposition of a militarized soldier image reinforces a dehumanizing frame that treats a religious child as an explosive device whose destruction is a legitimate act of 'defusal.' This combines religious targeting with age-based targeting and converts it into justification for lethal violence.\"\n      },\n      {\n        \"frame\": \"Muslims are dangerous terrorists by nature and therefore deserve violent removal.\",\n        \"rationale\": \"By linking a Muslim child to a 'bomb' and using militarized imagery, the meme promotes the stereotype that Muslims are inherently violent or terrorist threats. That stereotype is being used to justify physical elimination ('defusing' by killing), which is a propagandistic and dehumanizing narrative aimed at legitimizing aggressive actions.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Age\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Hostility/Aggression: Hate\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Stereotyping\",\n      \"Social/Cultural Control: Marginalization\"\n    ],\n    \"actions\": [\n      \"Physical Action: Violence\",\n      \"Verbal/Written Expressions: Insults\",\n      \"Verbal/Written Expressions: Provocation\",\n      \"Verbal/Written Expressions: Defamation\"\n    ]\n  }\n}"}
{"id": "img/06795.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslim men those who go to mosques won't come home because of extremist violence.\",\n        \"rationale\": \"The meme text explicitly links a husband not returning home with 'the mosque,' implying attendance at a Muslim place of worship leads to death or violent action. That constructs a causal, negative association between religion (Muslims) and violence. The image's mocking expression further trivializes and stigmatizes that outcome, turning it into a punchline rather than a serious human loss.\"\n      },\n      {\n        \"frame\": \"It's acceptable to mock and humiliate Muslims and their families by joking about their deaths or disappearance.\",\n        \"rationale\": \"By making a joke about a husband 'not coming home from the mosque' and pairing it with a derisive animal face, the meme normalizes ridicule of Muslim loss and suffering and demeans the spouse/family. This both humiliates the targeted religious group and encourages social exclusion and marginalization of their families by treating their grief as comedic fodder.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Family Status\",\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Violence\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/18632.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black people are inherently confused and lack intelligence or understanding.\",\n        \"rationale\": \"The meme uses an explicit racial slur and a caption that directly states that the quoted utterance \\\"indicates a nigger's confusion and lack of understanding,\\\" which attributes intellectual deficiency to the racial group. This frames Black people as cognitively inferior and is presented to demean and dehumanize them.\"\n      },\n      {\n        \"frame\": \"Black speech or dialect is unintelligible and a sign of incompetence.\",\n        \"rationale\": \"By mocking the quoted phrase (\\\"muh dick\\\") and linking it to 'confusion and lack of understanding,' the meme ridicules Black vernacular or pronunciation and uses it as supposed evidence of mental or social inferiority. This promotes a stereotype about how Black people speak and weaponizes language to humiliate them.\"\n      }\n    ],\n    \"targets\": [\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Hate\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/28617.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Feminists are hypersensitive who label everything sexist and believe only they understand discrimination.\",\n        \"rationale\": \"The meme's text mocks feminism by claiming \\\"everything is sexist and nobody understands but them,\\\" which stereotypes feminists (a gender-related group) as overly sensitive and self-appointed experts on sexism. This expresses prejudice and humiliation toward the target and functions as an insulting, provocative dismissal of their viewpoints.\"\n      },\n      {\n        \"frame\": \"Feminism is illegitimate and self-serving, so its concerns can be ignored.\",\n        \"rationale\": \"By reducing feminism to a caricature that sees sexism everywhere, the meme delegitimizes feminist claims and encourages marginalization and exclusion of that group's perspectives. The intent is social/cultural control via stereotyping and marginalization, communicated through derogatory written expression.\"\n      },],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\",\n      \"Exclusion\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/15427.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"People associated with modern Rome/Italy and their institutions are hypocritical and unfit to teach about Jesus because their ancient Roman ancestors killed Christ.\",\n        \"rationale\": \"The meme pairs images of ancient Roman soldiers with a contemporary figure representing the Catholic Church and the caption 'teach you about him? how can they if the romans killed christ'. This links modern Roman/Italian identity and institutions to a historical act, implying collective guilt and delegitimizing their authority to teach Christianity. The message stereotypes and humiliates a regional/national group by holding them responsible for past events and portrays them as untrustworthy religious instructors.\"\n      },\n      {\n        \"frame\": \"The Catholic Church is illegitimate and should not instruct people about Christianity because of historical blame.\",\n        \"rationale\": \"By showing a clerical figure (white robes/hand gesture) alongside the claim that 'the romans killed christ', the meme attacks religious leaders' credibility and asserts they are hypocrites or unqualified to teach about Christ. This delegitimizing of clergy functions as prejudice and humiliation toward a religious institution and its representatives, aiming to exclude or silence their moral or spiritual authority.\"\n      },\n], \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Religion/Belief\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Exclusion\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/31748.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Ramadan is a time for making bombs.\",\n        \"rationale\": \"The meme pairs the announcement of Ramadan with the phrase 'bombathon' and shows a man assembling an explosive device, directly linking the Muslim holy month to bomb-making and terrorism. This is a demeaning, defamatory stereotype that frames a religious group as violent and criminal (Religion/Belief). It functions as prejudice and humiliation (Discrimination/Prejudice) and as a stereotyping/propaganda device (Social/Cultural Control). The content uses written provocation and defamation to convey the attack (Verbal/Written Expressions: Provocation, Defamation) and normalizes violence (Hostility/Aggression: Violence, Hate).\"\n      } ],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Discrimination/Prejudice - Prejudice\",\n      \"Discrimination/Prejudice - Humiliation\",\n      \"Hostility/Aggression - Violence\",\n      \"Hostility/Aggression - Hate\",\n      \"Social/Cultural Control - Stereotyping\",\n      \"Social/Cultural Control - Exclusion\",\n      \"Social/Cultural Control - Marginalization\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions - Insults\",\n      \"Verbal/Written Expressions - Defamation\",\n      \"Verbal/Written Expressions - Provocation\"\n    ]\n  }\n}"}
{"id": "img/48567.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslim men are terrorists or affiliated with ISIS.\",\n        \"rationale\": \"The image shows male ice-cream vendors who appear to be from a Middle Eastern or Turkish background, and the caption replaces “choc ice” with “choc isis,” directly linking ordinary men to the terrorist group ISIS. That equates a demographic (religion/region/appearance) with violent extremism, which is a demeaning, prejudicial stereotype and a form of humiliation and hate.\"\n      },\n      ],\n    \"targets\": [\n      \"Religion/Belief\",\n ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/62471.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Jews are the globalists who secretly control international institutions and world affairs.\",\n        \"rationale\": \"The meme explicitly states \\\"the jews are the globalists\\\" and references \\\"international jewry,\\\" which promotes a classic antisemitic conspiracy that Jews collectively control global politics/economics. This is a defamatory stereotype aimed at a religious/ethnic group and functions as a prejudiced attribution of undue power and malicious intent.\"\n      },\n      {\n        \"frame\": \"Jews are an enemy responsible for broad, vague global problems.\",\n        \"rationale\": \"By labeling Jews as \\\"globalists\\\" and invoking the conspiratorial term \\\"international jewry,\\\" the meme reduces a diverse group to a single hostile actor and implicitly encourages blaming them for systemic issues. This is stereotyping and marginalization that fuels hostility and prejudice against the religious/ethnic group.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\",\n ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Propaganda\",\n],\n    \"actions\": [\n      \"Defamation\",\n      \"Provocation\",\n      \"Insults\"\n    ]\n  }\n}"}
{"id": "img/23681.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \" South Africa is endorsing the extermination of white people.\",\n        \"rationale\": \"The meme overlays the South African flag with the phrase 'this flag represents white genocide', directly claiming that the nation (symbolized by its flag) stands for or is responsible for the violent eradication of white people. This is an explicit race-based allegation that casts a national/ethnic group as perpetrators of extreme violence, serving as fearmongering and propaganda that promotes hostility toward the targeted group and the nation depicted. Because the message is delivered as text on an image, it operates as a verbal/written provocation and defamation of the country and of the groups it implies are responsible.\"\n      },\n     n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Hate\",\n      \"Discrimination/Prejudice: Prejudice\",\n      \"Social/Cultural Control: Propaganda\",\n      \"Social/Cultural Control: Stereotyping\",\n      \"Social/Cultural Control: Marginalization\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Provocation\",\n      \"Verbal/Written Expressions: Defamation\",\n      \"Verbal/Written Expressions: Insults\",\n      \"Physical Action: Violence\"\n    ]\n  }\n}"}
{"id": "img/78296.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Arabs/Muslims are ignorant and prone to believing false, backward ideas like the Earth is flat).\",\n        \"rationale\": \"The image shows two men in traditional Middle Eastern dress and the overlaid text contrasts 'whole world- earth is round' with an insulting reply implying the depicted person (labeled with a mock name 'buhammad') insists 'it's flat'. This frames the target group as scientifically illiterate and backward, which is a stereotypical and demeaning portrayal based on religion/ethnicity/region.\"\n      },\n      {\n        \"frame\": \"Arabs/Muslims are morally and sexually deviant.\",\n        \"rationale\": \"The meme uses the explicit slur 'goatfucker' directed at the people pictured and uses a mock name combining 'Muhammad' with a variant slur ('nibba'), pairing sexualized bestiality accusations with racial/ethnic insult. This communicates a dehumanizing sexual stereotype and invites contempt, humiliation, and abusive language toward the depicted group.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/48213.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslims are inherently anti-American and are the source of terrorism.\",\n        \"rationale\": \"The text asserts that the Middle East \\\"hates\\\" America and claims \\\"muslim terrorist are born in michigan,\\\" which collectively present Muslims as inherently hostile to the U.S. and as natural sources of terrorism. This frames the religious group (Muslim) as a security threat and attributes collective bad intent to them rather than treating individuals separately.\"\n      },\n      {\n        \"frame\": \"Muslim people living in the U.S. should be viewed with suspicion because they will become terrorists.\",\n        \"rationale\": \"The specific claim that Muslim terrorists are \\\"born in Michigan\\\" ties an American place to extremist origins and implies that Muslim residents or immigrants are predisposed to violence. This frames Muslim communities within the country as internal threats, encouraging marginalization, suspicion, and discrimination rather than distinguishing individuals.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Nationality/Region/Citizenship\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Hate\",\n      \"Marginalization\",\n      \"Exclusion\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/53062.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"It is acceptable to fear, exclude, or treat Muslims poorly because of the actions of some Muslims.\",\n        \"rationale\": \"By presenting fear (islamophobia) as a rational response caused by the group's behaviour, the meme encourages social exclusion and discrimination of the entire group for the acts of individuals. This is collective blame and stereotyping of a religious group (Religion/Belief) with the intent to marginalize and exclude (Stereotyping, Exclusion, Marginalization). The message functions as propaganda-like justification expressed in text that provokes and stigmatizes (Provocation, Defamation).\"\n      }],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Exclusion\",\n      \"Marginalization\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/71280.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black people are criminals and crime is inherent to Black people.\",\n        \"rationale\": \"The meme's punchline explicitly equates 'crime' with 'black people' (\\\"and crime is for black people\\\"), portraying Black people as intrinsically criminal. This dehumanizes the target by reducing a whole racial group to a criminal stereotype and encourages fear, stigma, and negative generalization.\"\n      }],\n    \"targets\": [\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Discrimination\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/24567.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"The murder and suffering of Jews during the Holocaust is acceptable material for humor and ridicule.\",\n        \"rationale\": \"The meme explicitly references Anne Frank — a well-known Jewish Holocaust victim — and presents her death as a joke ('just ordered the new anne frank puzzle'), normalizing ridicule of Holocaust victims. This is humiliation and prejudice toward Jews, expresses hate-hostile sentiment, and uses written provocation/insulting language to degrade a protected group.\"\n      },\n {\n        \"frame\": \"Jewish Holocaust victims can be dehumanized and treated as objects.\",\n        \"rationale\": \"The 'puzzle' metaphor combined with an image of ashes/bucket implies treating a murdered person's remains as an object or novelty, which dehumanizes victims and invokes desecration. This communicates violent, hateful hostility and humiliation, and the content functions as a provocative/desecrating verbal image that encourages disrespect toward the targeted group.\"\n      }\n ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Age\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Hate\",\n      \"Violence\",\n      \"Prejudice\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Desecration\"\n    ]\n  }\n}"}
{"id": "img/30942.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Jews are meant to be exterminated and their genocide should be celebrated.\",\n        \"rationale\": \"The meme uses Nazi imagery and the location 'Auschwitz' together with the caption '*jew cooking time stops*', evoking the Holocaust extermination ovens. This frames Jewish people as legitimate targets of mass murder and treats the ending or interruption of that murder as a punchline, endorsing violent hostility toward Jews.\"\n      },\n      {\n        \"frame\": \"Jewish people can be dehumanized and compared to objects/food to justify abuse.\",\n        \"rationale\": \"Referring to 'cooking time' equates Jewish people with food or objects to be processed, a dehumanizing metaphor used historically to justify extermination. The image and text together employ dehumanization as a mechanism that supports exclusion, marginalization, and violent acts against Jews.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Hostility/Aggression: Hate\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Stereotyping\",\n      \"Social/Cultural Control: Marginalization\",\n      \"Social/Cultural Control: Exclusion\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Insults\",\n      \"Verbal/Written Expressions: Provocation\",\n      \"Physical Action: Violence\",\n      \"Physical Action: Desecration\"\n    ]\n  }\n}"}
{"id": "img/16275.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Disabled girls are acceptable targets for sexual violence and may be further physically harmed to prevent them from reporting.\",\n        \"rationale\": \"The meme explicitly suggests raping a \\\"def girl\\\" (a misspelling of 'deaf') and then 'breaking her fingers after so she can't tell anyone.' This endorses sexual violence specifically directed at a person with a disability and advocates mutilation to silence her, treating a disabled girl as a permissible target rather than a protected person.\"\n      },\n      ],\n    \"targets\": [\n      \"Disability\",\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Silencing\",\n      \"Social/Cultural Control: Marginalization\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Provocation\",\n      \"Verbal/Written Expressions: Insults\",\n      \"Physical Action: Violence\"\n    ]\n  }\n}"}
{"id": "img/86045.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Slavery was benevolent and enslaved Black people were 'looked after' by their white masters.\",\n        \"rationale\": \"The bottom text \\\"master looks after us now\\\" presents a paternalistic, positive view of slavery. This frames the historical reality of enslavement as caring and protective rather than violent and exploitative, which erases trauma and demeans Black suffering. The image of a calm Black person reinforces the misleading narrative that slavery was beneficial or benign.\"\n      },\n ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Social/Cultural Control: Stereotyping\",\n      \"Social/Cultural Control: Propaganda\",\n      \"Discrimination/Prejudice: Prejudice\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Marginalization\",\n      \"Social/Cultural Control: Silencing\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Provocation\",\n      \"Verbal/Written Expressions: Insults\"\n    ]\n  }\n}"}
{"id": "img/12036.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Transgender identities are illegitimate and people should accept their 'actual born sex' for their own good.\",\n        \"rationale\": \"The text directly tells viewers to 'execute a plan to accept your actual born sex,' framing transgender identity as wrong and implying that people must revert to their sex assigned at birth to be happier. This communicates prejudice and an intent to correct or erase trans identities (social/cultural control), presents a humiliating directive, and functions as a provocative insult aimed at transgender people.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Discrimination\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Suppression\",\n      \"Marginalization\",\n      \"Manipulation\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/21305.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslims are an internal enemy who should be expelled from America.\",\n        \"rationale\": \"The image text explicitly says \\\"kick islam out of america,\\\" advocating removal/expulsion of a religious group from the country. This presents Muslims as unwanted outsiders and calls for a collective punitive action against them, which is an exclusionary and hostile demand targeting people for their religion/cultural identity.\"\n      },\n      {\n        \"frame\": \"Islam is evil and incompatible with American values.\",\n        \"rationale\": \"The line \\\"you can't walk with god holding hands with the devil\\\" equates Islam with the devil and frames it as morally evil and mutually exclusive with 'God' (implying true national/religious identity). This demonizes the religion, dehumanizes its followers, and justifies social rejection and moral condemnation, promoting prejudice, humiliation, stereotyping, and marginalization.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Violence\",\n      \"Exclusion\",\n      \"Suppression\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Provocation\",\n      \"Insults\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/61780.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black/African American people are primarily associated with problems like crime and poverty.\",\n        \"rationale\": \"The meme explicitly pairs the label \\\"african american\\\" with repeatedly mentioning the \\\"inner city,\\\" portraying Black people as defined by inner-city issues. This reduces a demographic group to a negative stereotype (crime/poverty) and promotes prejudiced associations rather than treating individuals as full persons.\"\n      },],\n    \"targets\": [\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Humiliation\",\n      \"Marginalization\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/76140.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Mexicans and Black people are interchangeable and equally valid targets of mockery.\",\n        \"rationale\": \"The meme explicitly states 'mexican and black jokes are all the same' and uses the parallel of the names 'Juan' and 'Jamal' to collapse two distinct groups into one interchangeable target. This normalizes treating both racial/ethnic groups as acceptable objects of humor, which is prejudicial and humiliating.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/65139.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Family members are disposable and appropriate targets of lethal violence.\",\n        \"rationale\": \"The meme's caption — 'they told me i would miss my family / i never miss at close range' — explicitly implies killing one's family and presents it without remorse. This frames family (a social group defined by family status) as legitimate targets of violence, normalizing lethal harm.\"\n      },\n      {\n        \"frame\": \"Threatening or joking about murdering one's family is acceptable and humorous.\",\n        \"rationale\": \"The meme uses a joking tone/common meme format to deliver a violent threat about family, which normalizes and trivializes violence and frames it as an acceptable form of humor or intimidation directed at family members.\"\n      }\n    ],\n    \"targets\": [\n      \"Socio-economic role: Family Status\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Discrimination/Prejudice: Humiliation\"\n    ],\n    \"actions\": [\n      \"Physical Action: Violence\",\n      \"Verbal/Written Expressions: Provocation\"\n    ]\n  }\n}"}
{"id": "img/75380.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Christians are a group that should be hated and condemned.\",\n        \"rationale\": \"The meme's top-line text, \\\"i hate christians,\\\" explicitly expresses hatred directed at Christians as a group. This is a direct hostile assertion that promotes animosity toward a religious group, framing them as deserving of contempt rather than addressing any specific behavior or individual.\"\n      },\n      {\n        \"frame\": \"All Christians are guilty of making harmful generalizations about people.\",\n        \"rationale\": \"The bottom text, \\\"they all make generalizations about people,\\\" attributes a negative trait to every member of the religious group, presenting a sweeping stereotype. This overgeneralization dehumanizes the group and fosters prejudice, portraying Christians as uniformly biased and reinforcing collective blame.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/20851.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Cis girls are bland, plain, and inferior.\",\n        \"rationale\": \"The meme juxtaposes two plates of pancakes: the top labeled \\\"me\\\" includes sausage and looks more substantial, while the bottom labeled \\\"cis girls\\\" shows a plain stack, implying cisgender women are boring or lacking. This constructs a comparative message that demeans a gender-related group (cis girls), which is a form of humiliation and stereotyping conveyed through the image and text.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/27416.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Women are meant to be sexually used and publicly humiliated for sexual acts.\",\n        \"rationale\": \"The meme uses a derogatory term for women and frames them as performing oral sex ('sucking ... dick') in a mocking tone, turning sexual behavior into a means of shaming and humiliating women. This is a verbal attack that sexualizes and degrades a gendered group.\"\n      },\n      ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/41679.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslims are animals and can be attacked or toyed with like prey.\",\n        \"rationale\": \"The meme pairs a snarling, aggressive dog image with the caption 'let me play with the muslims,' which dehumanizes Muslims by implying they are comparable to animals that a dog would 'play' with (i.e., attack). This evokes hostility and implicitly condones physical harm or violence toward the religious group.\"\n      },\n      ],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression - Violence\",\n      \"Hostility/Aggression - Hate\",\n      \"Discrimination/Prejudice - Humiliation\",\n      \"Social/Cultural Control - Marginalization\",\n      \"Discrimination/Prejudice - Prejudice\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions - Insults\",\n      \"Verbal/Written Expressions - Provocation\",\n      \"Physical Action - Violence\"\n    ]\n  }\n}"}
{"id": "img/41958.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"White people from lower socio-economic backgrounds are 'white trash'.\",\n        \"rationale\": \"The meme uses the slur \\\"white trash\\\" to label the people pictured, explicitly connecting race/ethnicity (white) with low socio-economic status and calling them contemptible. This expresses prejudice and humiliation toward a demographic group and reduces a complex social identity to an insulting stereotype, serving to marginalize and provoke ridicule.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Socio-economic Status\",\n      \"Age\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/41389.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"White people are inherently stupid and prone to doing dumb things.\",\n        \"rationale\": \"The meme's text explicitly labels \\\"white people\\\" as \\\"stupid\\\" and says they \\\"do dumb shit like this all the time,\\\" which generalizes a negative trait to an entire racial group. This is a race-based (Demographics: Race/Ethnicity) demeaning stereotype and functions as prejudice and humiliation. The expression is conveyed verbally in the meme's text, i.e., direct insults and provocation toward the target.\"\n      },\n  ],\n    \"targets\": [\n      \"Demographics: Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Discrimination/Prejudice: Prejudice\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Stereotyping\",\n      \"Hostility/Aggression: Hate\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Insults\",\n      \"Verbal/Written Expressions: Provocation\"\n    ]\n  }\n}"}
{"id": "img/16837.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"People who don't follow traditional gender presentation aren't really the gender they claim.\",\n        \"rationale\": \"The overlaid text \\\"it's mam / is it though?\\\" paired with two people of ambiguous or non‑stereotypical presentation casts doubt on the label \\\"mam\\\" and implicitly questions the person's gender. That framing delegitimizes gender identities that don't match traditional appearance, which is a form of gender‑based prejudice and public humiliation delivered via a mocking caption (a verbal/written provocation and insult).\"\n      },\n ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/28134.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"White people are inherently malodorous.\",\n        \"rationale\": \"The overlaid text explicitly asserts a negative, generalized attribute about an entire racial group (“white people”), turning it into an insulting stereotype. This is a prejudiced, humiliating claim directed at a demographic group (race/ethnicity). The meme uses a public image with recognizable Western leaders among many Arab men while the caption targets “white people,” reinforcing an us-vs-them mockery and performing a verbal insult and provocation.\"\n      },\n       ],\n    \"targets\": [\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/57802.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"People with prosthetic limbs are 'incomplete' or 'less whole'.\",\n        \"rationale\": \"The image clearly shows a person with a prosthetic limb and the text emphasizes 'missing parts,' implying the person is incomplete. This frames prosthetic users as defective and deserving of humiliation, which promotes prejudice and social exclusion against disabled people.\"\n      }\n    ],\n    \"targets\": [\n      \"Disability\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/05872.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslims are inherently violent terrorists who destroy public places.\",\n        \"rationale\": \"The meme pairs the line '3 muslims walk into a bar..' with an image of a wrecked, burned interior, implying the Muslims caused the destruction. This promotes a stereotype that Muslims commit violent, terroristic acts (targeting Religion/Belief) and frames them as a violent threat (Hostility/Aggression: Violence). The message functions as a provocation and insult (Verbal/Written Expressions: Provocation, Insults) by attributing collective criminal violence to a religious group.\"\n      },\n       ],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Violence\",\n      \"Humiliation\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/56374.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Declaring 'I'm a Nazi' and using racial slurs is acceptable bravado — openly.\",\n        \"rationale\": \"The meme text explicitly states 'im a nazi, i hate niggers' which is a self-identification with a violent, racist ideology combined with an explicit racial slur. The speaker frames this as a provocation/challenge ('gregg are you gonna punch me???'), normalizing public expression of racist hatred and daring others to react.\"\n      },\n   ],\n    \"targets\": [\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Hate\",\n      \"Provocation\",\n      \"Humiliation\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/31209.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Women get away with misconduct because of their gender, which unfairly marginalizes men in some jobs.\",\n        \"rationale\": \"By questioning why 'they didn't fire her too,' the meme implies women are allowed to engage in the same misconduct without consequences. This frames women as receiving protection or special treatment (target: Gender/Sex and implicitly Occupation/Profession — restaurant worker) and promotes stereotyping and marginalization (Intent: Social/Cultural Control — Stereotyping/Marginalization). The frame is expressed as a provocative, humiliating claim intended to shame or delegitimize the perceived unequal enforcement (Act: Verbal/Written Expressions — Insults/Provocation).\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Discrimination\",\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/21589.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Being 'born again' is childish and religious believers are immature.\",\n        \"rationale\": \"The meme text directly contrasts the religious concept of being \\\"born again\\\" with \\\"growing up,\\\" using the baptism image to mock the ritual. This frames a specific religious practice and its adherents as childish, which is a derogatory characterization aimed at people defined by their belief. The message functions as humiliation and stereotyping of Christians and expresses prejudice against their faith.\"\n      },\n      {\n        \"frame\": \"Religious conversion is a sign of personal regression rather than legitimate belief.\",\n        \"rationale\": \"By implying conversion equals immaturity, the meme delegitimizes the believers' experience and encourages marginalization of that religious group. The image/text pair provokes and insults the target, promoting a dismissive cultural narrative that pressures believers to change or be ridiculed.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief (born-again Christians / religious believers)\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/01256.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Abortion is a purchasable commodity, and people who seek abortions are careless consumers who deserve mockery when they can't pay.\",\n        \"rationale\": \"The meme frames an abortion appointment as a financial transaction — the punchline hinges on a debit card declining and the clinic 'having to put the baby back in.' That casts the person seeking an abortion as a consumer and reduces pregnancy/termination to a purchase, which stereotypes and humiliates the target. This implicates gendered targets (women) and invokes prejudice and stereotyping about responsibility and economic behavior.\"\n      },\n      {\n        \"frame\": \"People seeking abortions should be shamed or punished.\",\n        \"rationale\": \"The line about putting the baby back in reads as a punitive, coercive act and normalizes deriving humor from revoking reproductive autonomy. This expresses hostility toward abortion seekers and endorses humiliation and potential coercion/violence as an acceptable outcome, rather than treating abortion as a legitimate medical choice.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Discrimination/Prejudice - Prejudice\",\n      \"Discrimination/Prejudice - Humiliation\",\n      \"Hostility/Aggression - Violence\",\n      \"Social/Cultural Control - Stereotyping\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions - Provocation\",\n      \"Verbal/Written Expressions - Insults\",\n      \"Physical Action - Violence\"\n    ]\n  }\n}"}
{"id": "img/70123.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Transgender women are deceptive sexual predators who trick men into sexual acts.\",\n        \"rationale\": \"The meme uses the phrase \\\"when you accidentally pick up a tranny hooker\\\" together with \\\"suckin her cock,\\\" which implies a narrative of deception (the buyer thought the person was a cis woman but was 'tricked'). The slur \\\"tranny\\\" and the phrasing frame trans people as dishonest sexual 'traps,' portraying them as a threat or tricksters. This communicates prejudice and a harmful stereotype about transgender people and sexual encounters.\"\n      },\n      {\n        \"frame\": \"Transgender people are disgusting and should be mocked and humiliated.\",\n        \"rationale\": \"The meme pairs a disgusted facial image with the slur \\\"tranny\\\" and sexualized, derisive language. Presenting the scenario as humorous at the expense of a transgender sex worker communicates ridicule and demeaning attitudes, aiming to humiliate and marginalize the target group rather than describe them neutrally.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/09387.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Kenyan people (and by extension Black Africans) can be dehumanized and treated like pests or objects.\",\n        \"rationale\": \"The meme text 'check out the new kenyan fly strip' paired with a photo of a presumably Kenyan person lying with flies suggests equating Kenyan people to fly traps or pests. This is direct dehumanization and humiliation based on nationality/ethnicity and implies a hateful view that members of that group are less than human or only useful as objects.\"\n      },\n       ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\",\n      \"Socio-economic Status\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/83914.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Obama voters are subhuman and should be seen as apes rather than people.\",\n        \"rationale\": \"The meme pairs the label 'obama voters' with an image of chimpanzees, a classic visual device for dehumanization. This conveys that the targeted group is less than human, a form of humiliation and prejudice aimed at political supporters. The imagery and text function as an insulting, provocative statement that reduces a social/political group to animals and implies inferiority.\"\n      },\n      {\n        \"frame\": \"Obama voters are unintelligent, primitive, and deserve ridicule.\",\n        \"rationale\": \"By equating 'obama voters' with apes, the meme promotes a stereotype that the group's members lack intelligence or sophistication. This is a purposeful attempt to humiliate and stereotype a political constituency, using visual insult and provocation to marginalize and shame them.\"\n      }\n    ],\n    \"targets\": [\n      \"Demographics: Race/Ethnicity\",\n      \"Other: Political affiliation (Obama voters)\"\n    ],\n    \"intents\": [\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Discrimination/Prejudice: Prejudice\",\n      \"Social/Cultural Control: Stereotyping\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Insults\",\n      \"Verbal/Written Expressions: Provocation\"\n    ]\n  }\n}"}
{"id": "img/63042.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Somalis are like pests and can be violently removed without moral consequence.\",\n        \"rationale\": \"The meme explicitly compares Somalis to flies by asking how to \\\"kill 1000 flies with one hit\\\" and answering \\\"punch a somali in the face,\\\" which dehumanizes a nationality/ethnic group and frames physical violence against them as an appropriate means of elimination.\"\n      },\n      ],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Violence\",\n      \"Hate\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Physical Action - Violence\",\n      \"Verbal/Written Expressions - Insults\",\n      \"Verbal/Written Expressions - Provocation\"\n    ]\n  }\n}"}
{"id": "img/98726.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Making light of racialized historical or ongoing exploitation is acceptable humor.\",\n        \"rationale\": \"The image shows people picking cotton and the caption plays on the word \\\"dark\\\" to signal a taboo/‘dark’ joke tied to cotton-picking — a strong racialized signifier of slavery and forced labor. Framing the picture as punchline trivializes and mocks the suffering of racially oppressed groups.\"\n      },\n      {\n        \"frame\": \"People who perform manual, low-status labor are legitimate targets of ridicule and dehumanization.\",\n        \"rationale\": \"The meme centers cotton pickers as the object of the joke, treating their work and situation as humorous rather than humanizing. This targets occupation/socio‑economic status and reinforces contempt/stereotypes toward marginalized workers.\"\n      },\n      {\n        \"frame\": \"Using shocking, racially charged imagery to provoke laughter or attention is acceptable even if it humiliates marginalized groups.\",\n        \"rationale\": \"The caption explicitly aims for provocation by linking \\\"dark\\\" humor to an image evoking racial exploitation. That strategy prioritizes shock value over respect and functions to humiliate or desensitize viewers to the targeted group’s suffering.\"\n      }\n    ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Occupation/Profession\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/87054.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Jewish people are acceptable targets for violence including mass murder.\",\n        \"rationale\": \"The meme pairs a reference to an \\\"oven\\\" with the phrase \\\"my jewish friends,\\\" invoking the Holocaust and suggesting killing Jewish people as a joke. The presence of explicit Nazi imagery (swastika, uniform) reinforces an endorsement or normalization of genocidal violence. This combines an attack on a protected group (religion/ethnicity) with hostile, violent intent presented as humorous or trivial.\"\n      },\n      ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Hostility/Aggression: Hate\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Stereotyping\",\n      \"Social/Cultural Control: Exclusion\",\n      \"Social/Cultural Control: Marginalization\"\n    ],\n    \"actions\": [\n      \"Physical Action: Violence\",\n      \"Verbal/Written Expressions: Provocation\",\n      \"Verbal/Written Expressions: Insults\"\n    ]\n  }\n}"}
{"id": "img/52607.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Undocumented immigrants  are legitimate targets for lethal violence.\",\n        \"rationale\": \"The meme's explicit line \\\"i shoot ilegals\\\" is a direct endorsement of killing people labeled as 'illegals.' That advocates physical violence toward a group defined by legal/citizenship status, expressing hostility and a call to violent action rather than debate or policy.\"\n }],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Violence\",\n      \"Hate\",\n      \"Prejudice\",\n      \"Exclusion\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Violence\",\n      \"Provocation\",\n      \"Insults\"\n    ]\n  }\n}"}
{"id": "img/29075.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Male same-sex relationships are equivalent to relations with animals.\",\n        \"rationale\": \"The caption ('he can be his new boy firend') beneath an image of a man with a lion equates a man's romantic partner with an animal. This frames male homosexuality as bestiality or inherently absurd, which is a demeaning comparison that expresses prejudice and aims to humiliate the target.\"\n      },\n  ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/34097.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"People with disabilities are inherently incapable and deserve to be ridiculed.\",\n        \"rationale\": \"The image shows a person in a wheelchair paired with the caption calling an Etch A Sketch (a small, dexterity-based toy) the \\\"worst present ever.\\\" That pairing uses the person's disability as the punchline, implying they cannot use the toy and therefore are objects of mockery. This communicates prejudice and humiliation by portraying disability as incompetence and a source of humor.\"\n      },\n      {\n        \"frame\": \"Disabled people's needs and experiences are a joke and unworthy of empathy or accommodation.\",\n        \"rationale\": \"By framing the toy as an obviously inappropriate gift and treating that in a mocking way, the meme trivializes the lived experience and needs of disabled people rather than treating them with respect or inclusion. This normalizes marginalization and stereotyping of people with disabilities as less deserving of consideration.\"\n      }\n    ],\n    \"targets\": [\n      \"Disability\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/29587.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Texas churches are places for shooting rather than worship.\",\n        \"rationale\": \"The top text 'texas churches be like...' plus the bottom 'pew pew pew' uses a pun (pew = church bench; 'pew pew' = gunshot sound) to equate churches in Texas with gunfire. This frames a religious target (churchgoers/Christian churches) and a regional target (Texans) as violent and normalizes presence or use of guns in worship settings, which advances a stereotype and implies violent action.\"\n      },\n      {\n        \"frame\": \"Christian Texans are gun-obsessed and their religious identity is intertwined with aggression.\",\n        \"rationale\": \"The meme reduces a demographic (Texans/Christian church communities) to a single trait — enthusiasm for guns — turning a complex group into a contemptuous stereotype. That is a social/cultural stereotyping frame that also humiliates the targeted group by making their faith setting the butt of a gun-related joke.\"\n      },],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Social/Cultural Control: Stereotyping\",\n      \"Hostility/Aggression: Violence\",\n      \"Discrimination/Prejudice: Humiliation\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Provocation\",\n      \"Verbal/Written Expressions: Insults\",\n      \"Physical Action: Violence\"\n    ]\n  }\n}"}
{"id": "img/45281.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Women are shallow gold-diggers who only value men for their money and will not accept a 'broke' partner.\",\n        \"rationale\": \"The meme mocks women by implying they would not commit suicide over failing to find a poor man for marriage, which encodes a stereotype that women prioritize wealth in partners. This is a prejudiced and demeaning characterization of a gender group and links gender to socio-economic expectations.\"\n      },\n     ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/34985.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Americans are stupid, arrogant, and legitimate targets for insults and public humiliation.\",\n        \"rationale\": \"The meme text explicitly calls out \\\"you stupid arrogant americans\\\", which stereotypes and denigrates people on the basis of their nationality. This frames Americans as inferior and deserving of mockery, reflecting prejudice and an intent to humiliate and provoke a national group. The act is verbal — direct insults — aimed at a protected target (nationality/region).\"\n      },],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Propaganda\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/49615.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Immigrants are undeserving beneficiaries who are being prioritized for public money over elderly citizens.\",\n        \"rationale\": \"The meme pairs an image of elderly people with the caption 'no money for them' and a crowded group (implied migrants/foreigners) with 'plenty of money for them', framing a zero-sum transfer of resources that scapegoats immigrants as taking funds. This promotes xenophobic stereotyping (foreigners taking handouts), encourages resentment and exclusion, and works as a provocative, hostile narrative aimed at stirring prejudice and discrimination against people defined by nationality/immigration status.\"\n      },\n      ],\n    \"targets\": [\n      \"Age\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Discrimination/Prejudice - Prejudice\",\n      \"Discrimination/Prejudice - Discrimination\",\n      \"Discrimination/Prejudice - Humiliation\",\n      \"Social/Cultural Control - Stereotyping\",\n      \"Social/Cultural Control - Exclusion\",\n      \"Social/Cultural Control - Marginalization\",\n      \"Hostility/Aggression - Hate\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions - Provocation\",\n      \"Verbal/Written Expressions - Insults\"\n    ]\n  }\n}"}
{"id": "img/07458.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Transgender people are equivalent to Satan and deserve to be ridiculed and feared.\",\n        \"rationale\": \"The caption directly labels someone as \\\"transgender satan,\\\" equating a transgender identity with Satan. This is a dehumanizing comparison that vilifies the target and frames them as morally corrupt or evil, a form of prejudice and hate expressed through ridicule and provocation.\"\n      },\n      {\n        \"frame\": \"Transgender people should be mocked and socially excluded.\",\n        \"rationale\": \"The smug/mocking tone of \\\"is not amused\\\" combined with the demonizing label is intended to humiliate and demean. That tone encourages ridicule and contributes to stereotyping and marginalization of transgender people.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/41875.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Praising or normalizing sexual content involving minors is acceptable or funny.\",\n        \"rationale\": \"The meme text 'niccep' reads as a deliberately condensed/punned form of 'nice CP', a known coded compliment used online to refer to child sexual content. By presenting that line as something the speaker will 'say' when no one else will, the meme normalizes and trivializes praising sexual material involving children. This targets age (minors) and implicitly minimizes or encourages sexual violence/exploitation against that group. The delivery is a verbal/written provocation designed to elicit endorsement or shock.\"\n      },\n     ],\n    \"targets\": [\n      \"Age\"\n    ],\n    \"intents\": [\n      \"Violence\",\n      \"Propaganda\"\n    ],\n    \"actions\": [\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/97013.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Whiteness is inherently superior and more effective than non-white people.\",\n        \"rationale\": \"The meme equates the color 'white' with effectiveness by asking 'why is cocaine white?' and answering 'because it actually works.' This uses 'white' as a positive attribute and implies superiority, promoting a racial hierarchy that favors whiteness. The message frames race/appearance as a marker of value, which is prejudiced and demeaning to non-white groups.\"\n      },\n        ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/97463.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Members of 'antifa' are legitimate targets for violence.\",\n        \"rationale\": \"The meme text explicitly describes and celebrates running over 'antifa protestors' and hearing a victim being dragged, which normalizes and pleasures physical harm against a political/ideological group. This expresses schadenfreude and humiliation toward that group, frames violence as an appropriate response to their existence or actions, and functions as a provocation that can encourage real-world aggression. The target is an ideological/political group (framed here under belief/affiliation), the intent is hostile (promoting violence and hate while humiliating the group), and the means conveyed are both physical (vehicular assault) and communicative (provocative/insulting messaging that endorses harm).\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Violence\",\n      \"Hate\",\n      \"Humiliation\",\n      \"Provocation\"\n    ],\n    \"actions\": [\n      \"Violence\",\n      \"Provocation\",\n      \"Insults\"\n    ]\n  }\n}"}
{"id": "img/38051.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Women are expendable household objects who can be physically punished like appliances.\",\n        \"rationale\": \"The meme pairs a photograph of a woman with a black eye and a punchline that equates her to a 'dishwasher' — treating a person as an inanimate household appliance. That dehumanizing comparison normalizes physical punishment and frames violence as an appropriate response to a perceived 'fault' in a domestic role. This both objectifies women and encourages acceptance of domestic abuse as ordinary or justified.\"\n      },\n      {\n        \"frame\": \"Domestic abuse is trivial and a joke.\",\n        \"rationale\": \"The caption turns an image of an injured woman into punchline material, trivializing her injury and the seriousness of domestic violence. By making a joke out of a battered woman, the meme humiliates the target, reduces empathy, and signals that violence against women can be mocked or made light of — a form of normalization that promotes hostility and marginalization.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Violence\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Violence\",\n      \"Provocation\",\n      \"Insults\"\n    ]\n  }\n}"}
{"id": "img/91853.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"India should be an exclusionary national community that does not include Muslims.\",\n        \"rationale\": \"The meme frames membership in the national community as conditional and excludes a religious group, implying Muslims are outsiders who must be removed. This invokes Nationality/Region (India) alongside Religion/Belief and serves Social/Cultural Control purposes (exclusion, marginalization, suppression). It functions as propaganda/stereotyping to justify discrimination against Muslims.\"\n      },\n       ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Discrimination\",\n      \"Exclusion\",\n      \"Violence\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Provocation\",\n      \"Insults\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/84527.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Transgender people's concerns are trivial and deserve mockery rather than serious attention.\",\n        \"rationale\": \"The meme uses the slur \\\"tranny\\\" and the dismissive phrase \\\"don't get me started about your... problems,\\\" which rhetorically minimizes and derides trans people's issues. This frames trans people as a joke whose problems are not legitimate, a form of humiliation and marginalization.\"\n      },\n         ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/64273.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black youth are inherently dangerous and should immediately be met with lethal force by police.\",\n        \"rationale\": \"The meme pairs the phrase \\\"when cops see an unarmed black youth:\\\" with an image of officers aiming rifles, portraying an automatic, violent police response to a young Black person. This frames Black youths as perceived threats and condones or normalizes the use of lethal force against them, reflecting racial prejudice and violent hostility.\"\n      },\n ],\n    \"targets\": [\n      \"Demographics: Race/Ethnicity\",\n      \"Demographics: Age\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Discrimination/Prejudice: Prejudice\",\n      \"Social/Cultural Control: Stereotyping\",\n      \"Social/Cultural Control: Marginalization\"\n    ],\n    \"actions\": [\n      \"Physical Action: Violence\",\n      \"Verbal/Written Expressions: Provocation\"\n    ]\n  }\n}"}
{"id": "img/79124.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Using derogatory slurs is an acceptable way to show contempt for LGBTQ+ people.\",\n        \"rationale\": \"The meme's bottom text contains the explicit slur 'faggot' paired with 'i don't support', which directly uses a derogatory term aimed at sexual minorities to express rejection and contempt. That verbal attack frames LGBTQ+ people as objects of scorn and communicates that insulting them is permissible.\"\n      },\n      {\n        \"frame\": \"Men who display feminine physical traits like breasts are shameful and should be mocked.\",\n        \"rationale\": \"The top text 'luigi got big tiddies' mocks a male fictional character for having breasts, coupling gender-nonconforming presentation with ridicule. The use of a topless, sexualized image amplifies humiliation, portraying non-traditional gender expression as something to be derided.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/28590.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Working-class white people are inherently worthless and irredeemably 'white trash'.\",\n        \"rationale\": \"The meme uses the slur 'white trash' and the line 'will forever be white trash,' asserting a permanent, negative identity for white people associated with trailer-park or low-income status. This frames being white and poor as an immutable, shameful characteristic and expresses contempt and devaluation.\"\n      },\n     {\n        \"frame\": \"Removing someone from a poor or stigmatized environment doesn't change their nature.\",\n        \"rationale\": \"The top line 'you can take the trash out of the trailer park' combined with the bottom line asserts that changing a person's environment or circumstance doesn't remove their status as 'trash.' That promotes exclusion and social marginalization of lower-income white people and justifies continued humiliation despite any personal change.\"\n      }\n    ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\",\n      \"Exclusion\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/52483.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Indian men are sexually predatory and rapists.\",\n        \"rationale\": \"The meme explicitly names an \\\"Indian\\\" as the perpetrator of rape and presents that act as the defining trait by labeling him \\\"mr. worldwide.\\\" This attributes criminal, sexually violent behavior to a whole nationality/ethnic group, turning an individual crime into a generalized, negative characteristic of Indians.\"\n      },\n     {\n        \"frame\": \"People from India are dangerous to tourists and should be feared or avoided.\",\n        \"rationale\": \"The mention that an Indian raped tourists from three different countries, framed as a point of notoriety, promotes a stereotype that Indians are a threat to foreign visitors, encouraging fear and exclusion of the nationality as a whole.\"\n      }\n    ],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Race/Ethnicity\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\",\n      \"Violence\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/17953.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Young people who earn degrees quickly are lazy and their academic achievements are worthless compared with the decades of work by older people.\",\n        \"rationale\": \"The meme juxtaposes \\\"four years for your bachelor's?\\\" with \\\"I've worked 60 for my masters,\\\" implying that a college degree earned in a few years is inferior and deserving of contempt. This portrays younger degree-holders as entitled or lazy and elevates long labor as the only legitimate form of merit, a dismissive stereotype aimed at a generational group.\"\n      },\n      ],\n    \"targets\": [\n      \"Age\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Discrimination/Prejudice - Humiliation\",\n      \"Social/Cultural Control - Stereotyping\",\n      \"Discrimination/Prejudice - Prejudice\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions - Insults\",\n      \"Verbal/Written Expressions - Provocation\"\n    ]\n  }\n}"}
{"id": "img/95283.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Latin/Mexican immigrants should be celebrated being deported.\",\n        \"rationale\": \"The caption \\\"happy cinco de ported!\\\" conflates a culturally significant holiday (Cinco de Mayo) with the word \\\"deported,\\\" turning deportation into something to celebrate. This frames people associated with that holiday—implicitly Latinx or Mexican people and immigrants—as appropriate targets of humiliation and exclusion. The image pairs a triumphant-looking public figure with the slogan, reinforcing a celebratory, demeaning message that promotes prejudice, humiliation, and social exclusion of a nationality/ethnic group and of people with immigrant/legal status.\"\n      },\n       ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\",\n      \"Legal Status/Discrimination\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Exclusion\",\n      \"Marginalization\",\n      \"Stereotyping\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/47592.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"White men are inherently dangerous and responsible for historical violence.\",\n        \"rationale\": \"The meme's text — \\\"these white men are dangerous\\\" — makes a sweeping negative claim about \\\"white men\\\" as a group, attributing danger and culpability to them collectively. This expresses a prejudiced, hostile portrayal of a demographic defined by race and gender and functions as an insulting generalization and provocation.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Hate\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/96354.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Asians' eyes are inherently different, inferior and they make it hard for Asians to see.\",\n        \"rationale\": \"The meme explicitly asks \\\"why do asians have eyes like this? isn't it hard to see?\\\" which mocks a physical trait associated with a racial group and implies deficiency. This is a demeaning generalization about a protected demographic (race/ethnicity) and appearance, expressing prejudice and aiming to humiliate by portraying the group as biologically inferior.\"\n      },\n      {\n        \"frame\": \"It's acceptable to generalize and openly mock Asians' physical features.\",\n        \"rationale\": \"By framing the question as casual humor directed at a whole group, the meme normalizes stereotyping and public mockery of Asians. This serves to marginalize the group socially and encourages others to join in the ridicule, functioning as a form of stereotyping and provocation against that demographic.\"\n      }\n],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Appearance\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/71429.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"White people celebrate Cinco de Mayo as performative cultural appreciation while secretly wanting Latinos/immigrants deported.\",\n        \"rationale\": \"The top text explicitly calls out 'a white person' saying 'happy cinco de mayo' while asserting that 'deep in their heart they want you deported.' This frames white people as hypocritical and hostile toward Latino/immigrant communities, turning a festive greeting into evidence of xenophobic intent. The meme targets race/ethnicity and nationality/immigration status, and advances prejudice, stereotyping, and exclusion rather than a neutral observation.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Exclusion\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/06412.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"People who are in rehab or incarcerated are sexually available and disgusting.\",\n        \"rationale\": \"The meme calls the sexual partner a 'rehab romance booty' and pairs that phrase with an image of a woman in custody clothing, framing someone in rehab/jail as a degraded sexual object. The added line 'she's day 3 sick' expresses disgust and ridicule rather than sympathy, which stigmatizes and humiliates people with substance-use or legal issues.\"\n      },\n      {\n        \"frame\": \"Women who are vulnerable are for sexual use and subject to public shaming.\",\n        \"rationale\": \"The text sexualizes 'booty' and treats the woman's illness as punchline material, implying it's acceptable to use and then ridicule a woman's body when she's vulnerable. This frames women as disposable sexual objects and normalizes humiliation of female targets.\"\n      }\n    ],\n    \"targets\": [\n      \"Legal Status/Discrimination\",\n      \"Socio-economic Status\",\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/72936.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"It's acceptable to mock someone's facial features as a way to call them stupid.\",\n        \"rationale\": \"The meme pairs a photo of a named individual's facial expression with text equating hearing something 'so stupid' with getting that person's eyes — using a person's distinctive facial appearance as shorthand for stupidity. This is a form of humiliation and ridicule directed at appearance: it reduces a person to a physical characteristic and uses that characteristic to demean others (and by extension the person pictured). The attack is conveyed through written/verbal insult and provocation, and it relies on a simplistic stereotype that certain looks signal intellectual inferiority.\"\n      }\n    ],\n    \"targets\": [\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Prejudice\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/65273.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Israelis are inherently violent and capable of brutalizing innocent children.\",\n        \"rationale\": \"The meme's text explicitly blames 'israelis' for knocking out a 6-year-old's teeth; paired with the graphic image of a bloody child, it asserts that members of this national group commit extreme physical violence. This frames Israelis as violent perpetrators and attributes cruel behavior to the entire group.\"\n      },\n      ],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Violence\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Propaganda\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/27134.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"American-made products are superior and should be prioritized.\",\n        \"rationale\": \"The caption celebrates Walmart selling \\\"American made appliances again,\\\" linking product origin to national pride. That promotes an exclusionary, nativist frame that privileges a nationality (American) over foreign producers and implies that buying foreign-made goods is wrong or unpatriotic. This kind of messaging can marginalize or stigmatize people and companies associated with other countries and encourages consumer choices based on nationality rather than other criteria.\"\n      },\n  {\n        \"frame\": \"Trump is the cause of restoring American economic control.\",\n        \"rationale\": \"The meme directly attributes the change to 'trump,' presenting it as a causal, beneficial action. That is a propagandistic frame: it simplifies complex economic dynamics into a single-actor victory and uses a positive anecdote to manipulate opinion and bolster political support. Framing economic outcomes as the leader's personal achievement can polarize discourse and encourage political loyalty built on exclusionary economic ideas (e.g., 'buy American').\"\n      }\n    ],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Socio-economic role: Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Social/Cultural Control: Propaganda\",\n      \"Social/Cultural Control: Exclusion\",\n      \"Social/Cultural Control: Manipulation\",\n      \"Social/Cultural Control: Stereotyping\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Provocation\"\n    ]\n  }\n}"}
{"id": "img/89561.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black Jewish people are disposable and deserve extermination.\",\n        \"rationale\": \"The meme explicitly references 'the back of the oven,' invoking the Holocaust gas/cremation ovens, and links that violent imagery to someone who is both Black and Jewish. That frames members of these protected groups as appropriate targets for mass murder, which is explicit violent dehumanization and anti-Semitic, racist hostility.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Religion/Belief\"\n    ],\n    \"intents\": [\n      \"Hostility/Aggression: Violence\",\n      \"Hostility/Aggression: Hate\",\n      \"Discrimination/Prejudice: Prejudice\",\n      \"Discrimination/Prejudice: Humiliation\",\n      \"Social/Cultural Control: Marginalization\"\n    ],\n    \"actions\": [\n      \"Verbal/Written Expressions: Insults\",\n      \"Verbal/Written Expressions: Provocation\",\n      \"Physical Action: Violence\"\n    ]\n  }\n}"}
{"id": "img/05643.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Children in Africa are to blame for their own starvation because they are dirty and would simply eat flies on their faces.\",\n        \"rationale\": \"The meme explicitly says “kids in africa wouldn't starve if they ate the flies on their face,” which shifts responsibility for famine onto African children and frames them as unclean or animal-like. This is a demeaning stereotype that blames victims, humiliates the target, and treats a serious humanitarian crisis as a result of supposed inherent cultural/behavioral deficiency.\"\n      },\n     ],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Age\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/19875.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Muslims are violent and oppressive and want to kill gay people, reinstate slavery, and strip women of their rights.\",\n        \"rationale\": \"The meme's top text lists violent and oppressive acts (killing gays, making slavery legal, taking away women's rights) and the bottom text links those acts to being Muslim. This explicitly attributes extreme violence and oppression to the religious group, which is a dehumanizing stereotype and a hateful generalization. It targets a religious group (Muslims) while invoking harm against other protected groups (LGBTQ people and women). The intent is prejudicial and hateful (stereotyping and hostility) and the delivery is verbal provocation/defamation (insulting, accusing an entire religion of supporting atrocities).\"\n      },\n      ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Hate\",\n      \"Stereotyping\",\n      \"Humiliation\",\n      \"Exclusion\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/50278.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Women are inherently intellectually childlike and therefore unfit for mature thought or responsibility.\",\n        \"rationale\": \"The caption explicitly says women \\\"have the mind of a child,\\\" directly asserting intellectual inferiority. Paired with a sexualized image, the meme dismisses women's cognitive capacities and reduces them to childishness, which functions as prejudice and humiliation and encourages stereotyping and exclusion from serious roles or decision-making.\"\n      },\n      {\n        \"frame\": \"It's acceptable to present women as sexually mature while simultaneously infantilizing and dismissing their mental agency.\",\n        \"rationale\": \"The visual sexualization combined with the text separates sexual adulthood from mental competence, implying that women’s bodies can be treated as adult but their minds are childlike. This frames women as objects whose autonomy and opinions can be belittled, promoting marginalization and normalizing insulting, provocative depictions.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/08962.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Priests are acceptable targets for sexual jokes and ridicule.\",\n        \"rationale\": \"The meme uses three Catholic priests as the butt of a joke about being \\\"looked at,\\\" sexualizing and mocking them as a group. This treats a religious group (priests/clergy) as legitimate objects of ridicule and sexual humor, reflecting prejudice and humiliation toward a religion/belief group and using verbal provocation/insult to convey it.\"\n      },\n      {\n        \"frame\": \"Older people are invisible and sexually undesirable.\",\n        \"rationale\": \"The caption \\\"you know you're getting older when you walk by 3 priests and don't even get a look\\\" frames aging as making someone socially and sexually invisible. This expresses age-based prejudice and humiliation (ageism) by portraying older people as unwanted and mocked, conveyed through a mocking/verbal trope.\"\n      }\n    ],\n    \"targets\": [\n      \"Religion/Belief\",\n      \"Age\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/07261.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"American Gypsies are inherently low-class and disposable.\",\n        \"rationale\": \"The meme explicitly labels “american gypsies” as “white trash,” equating an ethnic group with a derogatory socio-economic slur. This treats the targeted group as inferior and disposable, expressing prejudice and stereotyping that reduces an ethnic/national group to a stigmatized class identity.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Nationality/Region/Citizenship\",\n      \"Socio-economic Status\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Defamation\"\n    ]\n  }\n}"}
{"id": "img/19380.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"People in special education are dangerous, hypersexual predators who commit sexual violence.\",\n        \"rationale\": \"The meme explicitly places 'special ed' students in the context of 'gangbanging the teacher,' portraying them as perpetrators of sexual violence. This frames people with disabilities as violent and sexually deviant rather than as people, which is hateful and stigmatizing toward a disability demographic (Disability). The intent is hostile and violent (Violence/Hate) and the means are expressed through provocative written text that insults and depicts physical harm (Provocation/Violence).\"\n      },\n      {\n        \"frame\": \"Disabled students can be dehumanized and depicted as incapable of normal behavior.\",\n        \"rationale\": \"By portraying students in special education as engaging in sexual acts with a teacher, the meme dehumanizes them and implies they are outside normal moral or social boundaries, which supports exclusion and silencing of disabled people. This targets disability and possibly age (students) and uses stereotypes to marginalize them (Stereotyping/Marginalization). The content promotes social control through mockery and defamatory depiction (Provocation/Insults) and depicts violent sexual action (Violence).\"\n      }\n    ],\n    \"targets\": [\n      \"Disability\",\n      \"Age\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\",\n      \"Violence\",\n      \"Hate\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\",\n      \"Violence\"\n    ]\n  }\n}"}
{"id": "img/64093.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Immigrants are criminals who arrange sham marriages to commit immigration fraud.\",\n        \"rationale\": \"The meme's text accuses someone of marrying their brother to commit immigration fraud and is paired with an image that uses visual cues associated with a religious/ethnic minority. Together this presents a broad, negative claim that immigrants (and by implication people of that religion/ethnicity) systematically commit fraud. This is a defamatory, prejudiced portrayal that stereotypes and humiliates the targeted groups and encourages discrimination and exclusion.\"\n      },\n      {\n        \"frame\": \"Women who display cultural or religious dress are untrustworthy and exploit host-country legal systems.\",\n        \"rationale\": \"By combining an accusation of criminality with a photo of a woman wearing visible cultural/religious dress, the meme frames such women as deceitful and manipulative. This uses appearance to stigmatize and marginalize a subset of women, serving a stereotyping and humiliating purpose and functioning as provocative propaganda against that social group.\"\n      }\n    ],\n    \"targets\": [\n      \"Nationality/Region/Citizenship\",\n      \"Religion/Belief\",\n      \"Gender/Sex/Sexual Orientation\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Exclusion\"\n    ],\n    \"actions\": [\n      \"Defamation\",\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/65978.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black women who alter their natural appearance are unnatural.\",\n        \"rationale\": \"The meme explicitly calls out a 'black girl with green contacts' and compares her to an 'xbox,' turning a Black woman's appearance into an object for mockery. This dehumanizing comparison is targeted at race and gender and attacks appearance; its tone is mocking and humiliating, using an insulting phrase ('bitch, stop it') to provoke laughter at the expense of the targeted group.\"\n      },\n      ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Gender/Sex/Sexual Orientation\",\n      \"Appearance\"\n    ],\n    \"intents\": [\n      \"Humiliation\",\n      \"Prejudice\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/03421.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Mass shootings are a means of asserting identity, and perpetrators should be publicly celebrated.\",\n        \"rationale\": \"By pairing triumphant language with the image and the phrase about \\\"achievement,\\\" the meme suggests that carrying out such violence confers status. That shifts the social meaning of violent acts into a form of self-promotion or identity assertion, which is a form of propaganda that normalizes and romanticizes violence against a targeted demographic (school-aged people and school staff).\"\n      }\n   ],\n    \"targets\": [\n      \"Age\",\n      \"Occupation/Profession\"\n    ],\n    \"intents\": [\n      \"Violence\",\n      \"Humiliation\",\n      \"Propaganda\"\n    ],\n    \"actions\": [\n      \"Violence\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/85291.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Black men are absentee or 'deadbeat' fathers who don't care for their children.\",\n        \"rationale\": \"The meme's caption 'how to get a black guy to see his baby' paired with an image of a baby in a box communicates the stereotype that Black men do not participate in their children's lives. This frames Black men (race) and specifically male Black people (gender) as neglectful parents. The wording and imagery function as an insulting, provocative generalization (prejudice/stereotyping) intended to humiliate and demean the targeted group, contributing to social marginalization.\"\n      },\n       ],\n    \"targets\": [\n      \"Race/Ethnicity\",\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}
{"id": "img/50817.png", "response": "{\n  \"hate_frames\": {\n    \"frames\": [\n      {\n        \"frame\": \"Transgender identities are just attention-seeking and therefore not legitimate.\",\n        \"rationale\": \"The meme pairs the single-word label \\\"transgender\\\" with the caption \\\"when just being gay doesn't get you the attention you rightfully deserve!\\\" — this directly implies that people who are transgender transition or present as trans primarily to gain attention rather than because their identity is genuine. That message targets Gender/Sex/Sexual Orientation, expresses prejudice and humiliation (treating trans identity as a joke or performance), and is delivered via written provocation and insult.\"\n      },\n      {\n        \"frame\": \"Transgender people deserve ridicule and are inferior to gay people.\",\n        \"rationale\": \"By framing being trans as a lesser or attention-seeking alternative to \\\"being gay,\\\" the meme promotes stereotyping and social exclusion of transgender people, encouraging mockery rather than understanding. This constitutes humiliation and marginalization of a protected demographic and is enacted through insulting, provocative language and imagery.\"\n      }\n    ],\n    \"targets\": [\n      \"Gender/Sex/Sexual Orientation\"\n    ],\n    \"intents\": [\n      \"Prejudice\",\n      \"Humiliation\",\n      \"Stereotyping\",\n      \"Marginalization\"\n    ],\n    \"actions\": [\n      \"Insults\",\n      \"Provocation\"\n    ]\n  }\n}"}

